<h3>Pitchfork is a music-centric online magazine. It was started in 1995 and grew out of independent music reviewing into a general publication format, but is still famed for its variety music reviews. </h3>

<h2>Objectives</h2>
<ul>
    <li>Do review scores for individual artists generally improve over time, or go down?</li>
    <li>How has Pitchfork's review genre selection changed over time?</li>
    <li>Who are the most highly rated artists? The least highly rated artists?</li>
</ul>

In [9]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

In [10]:
engine = create_engine('sqlite:///database.sqlite')

In [11]:
table_names = engine.table_names()
print(table_names)

['artists', 'content', 'genres', 'labels', 'reviews', 'years']

In [27]:
with engine.connect() as con:
    rs = con.execute("SELECT * FROM artists")
    artists = pd.DataFrame(rs.fetchall())
    artists.columns = rs.keys()
    
    rs = con.execute("SELECT * FROM content")
    content = pd.DataFrame(rs.fetchall())
    content.columns = rs.keys()
    
    rs = con.execute("SELECT * FROM genres")
    genres = pd.DataFrame(rs.fetchall())
    genres.columns = rs.keys()
    
    rs = con.execute("SELECT * FROM labels")
    labels = pd.DataFrame(rs.fetchall())
    labels.columns = rs.keys()
    
    rs = con.execute("SELECT * FROM reviews")
    reviews = pd.DataFrame(rs.fetchall())
    reviews.columns = rs.keys()
    
    rs = con.execute("SELECT * FROM years")
    years = pd.DataFrame(rs.fetchall())
    years.columns = rs.keys()

In [29]:
years.head()

   reviewid    year
0     22703  1998.0
1     22721  2016.0
2     22659  2016.0
3     22661  2016.0
4     22725  2016.0